<?xml version="1.0" ?>
<net name="person-vehicle-bike-detection-crossroad-1016" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 512, 512"/>
			<output>
				<port id="0" names="input.1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input.1/scale_input_port_1/value284221043" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input.1/scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_mul_11455" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="391/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_11457" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="391/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="391" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="393/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="14" shape="32, 3, 3, 3" size="1728"/>
			<output>
				<port id="0" names="6" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="392" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_add_1146011465" type="Const" version="opset1">
			<data element_type="f16" offset="1742" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="393/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="393" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="394" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="394" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="396/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1806" shape="32, 1, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="12" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="395" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_1146811473" type="Const" version="opset1">
			<data element_type="f16" offset="2382" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="396/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="396" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="397" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="397" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="399/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="2446" shape="16, 32, 1, 1" size="1024"/>
			<output>
				<port id="0" names="18" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="398" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_1147611481" type="Const" version="opset1">
			<data element_type="f16" offset="3470" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="399/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="399" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="401/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="3502" shape="96, 16, 1, 1" size="3072"/>
			<output>
				<port id="0" names="24" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="400" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_1148411489" type="Const" version="opset1">
			<data element_type="f16" offset="6574" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="401/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="401" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="402" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="402" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="404/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="6766" shape="96, 1, 1, 3, 3" size="1728"/>
			<output>
				<port id="0" names="30" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="403" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_1149211497" type="Const" version="opset1">
			<data element_type="f16" offset="8494" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="404/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="404" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="405" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="405" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="407/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="8686" shape="24, 96, 1, 1" size="4608"/>
			<output>
				<port id="0" names="36" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="406" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_1150011505" type="Const" version="opset1">
			<data element_type="f16" offset="13294" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="407/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="407" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="409/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="13342" shape="144, 24, 1, 1" size="6912"/>
			<output>
				<port id="0" names="42" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="408" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="data_add_1150811513" type="Const" version="opset1">
			<data element_type="f16" offset="20254" shape="1, 144, 1, 1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="409/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="409" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="410" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="410" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="412/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="20542" shape="144, 1, 1, 3, 3" size="2592"/>
			<output>
				<port id="0" names="48" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="411" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="data_add_1151611521" type="Const" version="opset1">
			<data element_type="f16" offset="23134" shape="1, 144, 1, 1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="412/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="412" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="413" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="413" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="415/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="23422" shape="24, 144, 1, 1" size="6912"/>
			<output>
				<port id="0" names="54" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="414" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="data_add_1152411529" type="Const" version="opset1">
			<data element_type="f16" offset="30334" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="415/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="415" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="416" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="416" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="418/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="30382" shape="144, 24, 1, 1" size="6912"/>
			<output>
				<port id="0" names="60" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="417" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="data_add_1153211537" type="Const" version="opset1">
			<data element_type="f16" offset="37294" shape="1, 144, 1, 1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="418/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="418" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="419" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="419" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="421/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="37582" shape="144, 1, 1, 3, 3" size="2592"/>
			<output>
				<port id="0" names="66" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="420" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="data_add_1154011545" type="Const" version="opset1">
			<data element_type="f16" offset="40174" shape="1, 144, 1, 1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="421/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="421" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="422" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="422" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="424/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="40462" shape="32, 144, 1, 1" size="9216"/>
			<output>
				<port id="0" names="72" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="423" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="data_add_1154811553" type="Const" version="opset1">
			<data element_type="f16" offset="49678" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="424/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="424" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="426/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="49742" shape="192, 32, 1, 1" size="12288"/>
			<output>
				<port id="0" names="78" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="425" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_1155611561" type="Const" version="opset1">
			<data element_type="f16" offset="62030" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="426/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="426" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="427" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="427" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="429/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="62414" shape="192, 1, 1, 3, 3" size="3456"/>
			<output>
				<port id="0" names="84" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="428" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="data_add_1156411569" type="Const" version="opset1">
			<data element_type="f16" offset="65870" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="429/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="429" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="430" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="430" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="432/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="66254" shape="32, 192, 1, 1" size="12288"/>
			<output>
				<port id="0" names="90" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="431" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="data_add_1157211577" type="Const" version="opset1">
			<data element_type="f16" offset="78542" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="432/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="432" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="433" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="433" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="435/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="78606" shape="192, 32, 1, 1" size="12288"/>
			<output>
				<port id="0" names="96" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="434" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_1158011585" type="Const" version="opset1">
			<data element_type="f16" offset="90894" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="435/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="435" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="436" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="436" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="438/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="91278" shape="192, 1, 1, 3, 3" size="3456"/>
			<output>
				<port id="0" names="102" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="437" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="data_add_1158811593" type="Const" version="opset1">
			<data element_type="f16" offset="94734" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="438/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="438" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="439" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="439" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="441/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="95118" shape="32, 192, 1, 1" size="12288"/>
			<output>
				<port id="0" names="108" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="440" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_add_1159611601" type="Const" version="opset1">
			<data element_type="f16" offset="107406" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="441/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="441" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="442" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="442" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="444/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="107470" shape="192, 32, 1, 1" size="12288"/>
			<output>
				<port id="0" names="114" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="443" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="data_add_1160411609" type="Const" version="opset1">
			<data element_type="f16" offset="119758" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="444/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="444" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="445" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="445" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="447/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="120142" shape="192, 1, 1, 3, 3" size="3456"/>
			<output>
				<port id="0" names="120" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="446" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="data_add_1161211617" type="Const" version="opset1">
			<data element_type="f16" offset="123598" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="447/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="447" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="448" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="448" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="450/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="123982" shape="64, 192, 1, 1" size="24576"/>
			<output>
				<port id="0" names="126" precision="FP16">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="449" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="data_add_1162011625" type="Const" version="opset1">
			<data element_type="f16" offset="148558" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="450/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="450" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="452/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="148686" shape="384, 64, 1, 1" size="49152"/>
			<output>
				<port id="0" names="132" precision="FP16">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="451" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="data_add_1162811633" type="Const" version="opset1">
			<data element_type="f16" offset="197838" shape="1, 384, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="452/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="452" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="453" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="453" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="455/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="198606" shape="384, 1, 1, 3, 3" size="6912"/>
			<output>
				<port id="0" names="138" precision="FP16">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="454" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
