<?xml version="1.0" ?>
<net name="common-sign-language-0002" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 8, 224, 224"/>
			<output>
				<port id="0" names="input" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_804918126" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 3, 1, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_805118141" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1, 3, 1, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="682" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="16, 3, 1, 3, 3" size="864"/>
			<output>
				<port id="0" names="682" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 1, 1" pads_end="0, 1, 1" strides="1, 2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>8</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_0/Dims4953" type="Const" version="opset1">
			<data element_type="f16" offset="876" shape="1, 16, 1, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="681" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_1" type="Const" version="opset1">
			<data element_type="f16" offset="908" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="319" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="320" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Clip_3" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="321" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="822" type="Const" version="opset1">
			<data element_type="f16" offset="910" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="822" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Div_4" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="324" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Mul_5" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" names="325" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="685" type="Const" version="opset1">
			<data element_type="f16" offset="912" shape="16, 1, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" names="685" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_6/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 1, 1" pads_end="0, 1, 1" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_6/Dims4941" type="Const" version="opset1">
			<data element_type="f16" offset="1200" shape="1, 16, 1, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="684" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="328" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="688" type="Const" version="opset1">
			<data element_type="f16" offset="1232" shape="16, 16, 5, 1, 1" size="2560"/>
			<output>
				<port id="0" names="688" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="2, 0, 0" pads_end="2, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_8/Dims4929" type="Const" version="opset1">
			<data element_type="f16" offset="3792" shape="1, 16, 1, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="687" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Add_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" names="331" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="691" type="Const" version="opset1">
			<data element_type="f16" offset="3824" shape="64, 16, 1, 1, 1" size="2048"/>
			<output>
				<port id="0" names="691" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_10/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_10/Dims5097" type="Const" version="opset1">
			<data element_type="f16" offset="5872" shape="1, 64, 1, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="690" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Relu_11" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="334" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="694" type="Const" version="opset1">
			<data element_type="f16" offset="6000" shape="64, 1, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" names="694" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_12/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 1, 1" pads_end="0, 1, 1" strides="1, 2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_12/Dims4995" type="Const" version="opset1">
			<data element_type="f16" offset="7152" shape="1, 64, 1, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="693" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Relu_13" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="337" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="697" type="Const" version="opset1">
			<data element_type="f16" offset="7280" shape="24, 64, 3, 1, 1" size="9216"/>
			<output>
				<port id="0" names="697" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_14/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="1, 0, 0" pads_end="1, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_14/Dims5049" type="Const" version="opset1">
			<data element_type="f16" offset="16496" shape="1, 24, 1, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_14" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="340,696" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="AveragePool_16" type="AvgPool" version="opset1">
			<data auto_pad="explicit" exclude-pad="true" kernel="2, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" rounding_type="floor" strides="2, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="341" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="700" type="Const" version="opset1">
			<data element_type="f16" offset="16544" shape="72, 24, 1, 1, 1" size="3456"/>
			<output>
				<port id="0" names="700" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_17/Dims4935" type="Const" version="opset1">
			<data element_type="f16" offset="20000" shape="1, 72, 1, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="699" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Relu_18" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="344" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="703" type="Const" version="opset1">
			<data element_type="f16" offset="20144" shape="72, 1, 1, 1, 3, 3" size="1296"/>
			<output>
				<port id="0" names="703" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_19/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 1, 1" pads_end="0, 1, 1" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_19/Dims5109" type="Const" version="opset1">
			<data element_type="f16" offset="21440" shape="1, 72, 1, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="702" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Relu_20" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="347" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="706" type="Const" version="opset1">
			<data element_type="f16" offset="21584" shape="24, 72, 3, 1, 1" size="10368"/>
			<output>
				<port id="0" names="706" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="1, 0, 0" pads_end="1, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_21/Dims5055" type="Const" version="opset1">
			<data element_type="f16" offset="31952" shape="1, 24, 1, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="705" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Add_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="350" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="709" type="Const" version="opset1">
			<data element_type="f16" offset="32000" shape="72, 24, 1, 1, 1" size="3456"/>
			<output>
				<port id="0" names="709" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_23/Dims5133" type="Const" version="opset1">
			<data element_type="f16" offset="35456" shape="1, 72, 1, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="708" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Relu_24" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="353" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="712" type="Const" version="opset1">
			<data element_type="f16" offset="35600" shape="72, 1, 1, 1, 5, 5" size="3600"/>
			<output>
				<port id="0" names="712" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_25/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 2, 2" pads_end="0, 2, 2" strides="1, 2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_25/Dims4899" type="Const" version="opset1">
			<data element_type="f16" offset="39200" shape="1, 72, 1, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_25" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="356,711" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="AveragePool_27" type="AvgPool" version="opset1">
			<data auto_pad="explicit" exclude-pad="true" kernel="1, 28, 28" pads_begin="0, 0, 0" pads_end="0, 0, 0" rounding_type="floor" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="357" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="backbone.features.4.conv.5.fc.0.weight" type="Const" version="opset1">
			<data element_type="f16" offset="39344" shape="18, 72, 1, 1, 1" size="2592"/>
			<output>
				<port id="0" names="backbone.features.4.conv.5.fc.0.weight" precision="FP16">
					<dim>18</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_28/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>18</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_28/Dims5025" type="Const" version="opset1">
			<data element_type="f16" offset="41936" shape="1, 18, 1, 1, 1" size="36"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="358" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Relu_29" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="359" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="backbone.features.4.conv.5.fc.2.weight" type="Const" version="opset1">
			<data element_type="f16" offset="41972" shape="72, 18, 1, 1, 1" size="2592"/>
			<output>
				<port id="0" names="backbone.features.4.conv.5.fc.2.weight" precision="FP16">
					<dim>72</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_30/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_80538055" type="Const" version="opset1">
			<data element_type="f16" offset="44564" shape="1, 72, 1, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_30/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="362" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Clip_33" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="363" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="823" type="Const" version="opset1">
			<data element_type="f16" offset="910" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="823" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Div_34" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="366" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Mul_35" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" names="367" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Relu_36" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="368" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="715" type="Const" version="opset1">
			<data element_type="f16" offset="44708" shape="40, 72, 3, 1, 1" size="17280"/>
			<output>
				<port id="0" names="715" precision="FP16">
					<dim>40</dim>
					<dim>72</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_37/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="1, 0, 0" pads_end="1, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>72</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_37/Dims4965" type="Const" version="opset1">
			<data element_type="f16" offset="61988" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="714" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="718" type="Const" version="opset1">
			<data element_type="f16" offset="62068" shape="120, 40, 1, 1, 1" size="9600"/>
			<output>
				<port id="0" names="718" precision="FP16">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_38/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_38/Dims5163" type="Const" version="opset1">
			<data element_type="f16" offset="71668" shape="1, 120, 1, 1, 1" size="240"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_38" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="717" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Relu_39" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="373" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="721" type="Const" version="opset1">
			<data element_type="f16" offset="71908" shape="120, 1, 1, 1, 5, 5" size="6000"/>
			<output>
				<port id="0" names="721" precision="FP16">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_40/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 2, 2" pads_end="0, 2, 2" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_40/Dims5115" type="Const" version="opset1">
			<data element_type="f16" offset="77908" shape="1, 120, 1, 1, 1" size="240"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_40" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="376,720" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="AveragePool_42" type="AvgPool" version="opset1">
			<data auto_pad="explicit" exclude-pad="true" kernel="1, 28, 28" pads_begin="0, 0, 0" pads_end="0, 0, 0" rounding_type="floor" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="377" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="backbone.features.5.conv.5.fc.0.weight" type="Const" version="opset1">
			<data element_type="f16" offset="78148" shape="30, 120, 1, 1, 1" size="7200"/>
			<output>
				<port id="0" names="backbone.features.5.conv.5.fc.0.weight" precision="FP16">
					<dim>30</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_43/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>30</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_43/Dims5139" type="Const" version="opset1">
			<data element_type="f16" offset="85348" shape="1, 30, 1, 1, 1" size="60"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="378" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Relu_44" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="379" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="backbone.features.5.conv.5.fc.2.weight" type="Const" version="opset1">
			<data element_type="f16" offset="85408" shape="120, 30, 1, 1, 1" size="7200"/>
			<output>
				<port id="0" names="backbone.features.5.conv.5.fc.2.weight" precision="FP16">
					<dim>120</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>120</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="data_add_80578059" type="Const" version="opset1">
			<data element_type="f16" offset="92608" shape="1, 120, 1, 1, 1" size="240"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_45/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="382" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Clip_48" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="383" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="824" type="Const" version="opset1">
			<data element_type="f16" offset="910" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="824" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Div_49" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
