<?xml version="1.0" ?>
<net name="person-detection-asl-0001" version="10">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 320, 320"/>
			<output>
				<port id="0" names="image" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="1260" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1600, 2" size="12800"/>
			<output>
				<port id="0" names="1260" precision="FP32">
					<dim>1600</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data_mul_38052" type="Const" version="opset1">
			<data element_type="f32" offset="12800" shape="1, 3, 1, 1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="image/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_add_38054" type="Const" version="opset1">
			<data element_type="f32" offset="12812" shape="1, 3, 1, 1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="image/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="391/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="12824" shape="24, 3, 3, 3" size="2592"/>
			<output>
				<port id="0" names="backbone.features.init_block.conv.conv.weight" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="390" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_add_3805738062" type="Const" version="opset1">
			<data element_type="f32" offset="15416" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="391/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="391" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="392" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="392" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="393" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="ceil" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="393" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="395/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="15512" shape="24, 1, 1, 3, 3" size="864"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit1.dw_conv4.weight" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="394" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_3808938094" type="Const" version="opset1">
			<data element_type="f32" offset="16376" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="395/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="395" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="397/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="16472" shape="58, 24, 1, 1" size="5568"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit1.expand_conv5.weight" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="396" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_3809738102" type="Const" version="opset1">
			<data element_type="f32" offset="22040" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="397/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="397" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="398" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="398" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="400/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="22272" shape="58, 24, 1, 1" size="5568"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit1.compress_conv1.weight" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="399" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_3806538070" type="Const" version="opset1">
			<data element_type="f32" offset="27840" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="400/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="400" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="401" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="401" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="403/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="28072" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit1.dw_conv2.weight" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="402" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_3807338078" type="Const" version="opset1">
			<data element_type="f32" offset="30160" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="403/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="403" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="405/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="30392" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit1.expand_conv3.weight" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="404" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_add_3808138086" type="Const" version="opset1">
			<data element_type="f32" offset="43848" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="405/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="405" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="406" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="406" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="407" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" names="407" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="409" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="409" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="408" type="Const" version="opset1">
			<data element_type="i32" offset="44080" shape="" size="4"/>
			<output>
				<port id="0" names="408" precision="I32"/>
			</output>
		</layer>
		<layer id="38" name="410/axis" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="39" name="4102918" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="410" precision="I64"/>
			</output>
		</layer>
		<layer id="40" name="423/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="423/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="423" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="424/Unsqueeze" type="Const" version="opset1">
			<data element_type="i64" offset="44092" shape="1" size="8"/>
			<output>
				<port id="0" names="424" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="412" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="412" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="411" type="Const" version="opset1">
			<data element_type="i32" offset="44100" shape="" size="4"/>
			<output>
				<port id="0" names="411" precision="I32"/>
			</output>
		</layer>
		<layer id="45" name="413/axis" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="46" name="4132888" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="413" precision="I64"/>
			</output>
		</layer>
		<layer id="47" name="420" type="Const" version="opset1">
			<data element_type="i64" offset="44092" shape="" size="8"/>
			<output>
				<port id="0" names="420" precision="I64"/>
			</output>
		</layer>
		<layer id="48" name="421" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="421" precision="I64"/>
			</output>
		</layer>
		<layer id="49" name="425/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="425/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="425" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="415" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="415" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="414" type="Const" version="opset1">
			<data element_type="i32" offset="44104" shape="" size="4"/>
			<output>
				<port id="0" names="414" precision="I32"/>
			</output>
		</layer>
		<layer id="53" name="416/axis" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="54" name="4162716" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="416" precision="I64"/>
			</output>
		</layer>
		<layer id="55" name="426/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="426/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="426" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="418" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="418" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="417" type="Const" version="opset1">
			<data element_type="i32" offset="44108" shape="" size="4"/>
			<output>
				<port id="0" names="417" precision="I32"/>
			</output>
		</layer>
		<layer id="59" name="419/axis" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="60" name="4192798" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="419" precision="I64"/>
			</output>
		</layer>
		<layer id="61" name="427/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="427/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="427" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="428" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" names="428" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="429" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="429" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="1718" type="Const" version="opset1">
			<data element_type="i64" offset="44112" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="430" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="430" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="431/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="431/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="431" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="432/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="432/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="432" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="433/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="433/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="433" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="434/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="434/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="434" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="435" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="435" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="436" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="436" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="437/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="44152" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="78" name="437/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" offset="44160" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="437/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="437" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" names="438" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="440/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="44176" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit2.compress_conv1.weight" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="439" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="data_add_3810538110" type="Const" version="opset1">
			<data element_type="f32" offset="57632" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="440/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="440" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="441" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="441" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="443/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="57864" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit2.dw_conv2.weight" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="442" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="data_add_3811338118" type="Const" version="opset1">
			<data element_type="f32" offset="59952" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="443/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="443" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="445/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="60184" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit2.expand_conv3.weight" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="444" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_add_3812138126" type="Const" version="opset1">
			<data element_type="f32" offset="73640" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="445/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="445" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="446" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="446" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="447" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" names="447" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="449" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="449" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="448" type="Const" version="opset1">
			<data element_type="i32" offset="44080" shape="" size="4"/>
			<output>
				<port id="0" names="448" precision="I32"/>
			</output>
		</layer>
		<layer id="97" name="450/axis" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="98" name="4502982" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="450" precision="I64"/>
			</output>
		</layer>
		<layer id="99" name="463/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="463/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="463" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="464/Unsqueeze" type="Const" version="opset1">
			<data element_type="i64" offset="44092" shape="1" size="8"/>
			<output>
				<port id="0" names="464" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="452" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="452" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="451" type="Const" version="opset1">
			<data element_type="i32" offset="44100" shape="" size="4"/>
			<output>
				<port id="0" names="451" precision="I32"/>
			</output>
		</layer>
		<layer id="104" name="453/axis" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="105" name="4532956" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="453" precision="I64"/>
			</output>
		</layer>
		<layer id="106" name="460" type="Const" version="opset1">
			<data element_type="i64" offset="44092" shape="" size="8"/>
			<output>
				<port id="0" names="460" precision="I64"/>
			</output>
		</layer>
		<layer id="107" name="461" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="461" precision="I64"/>
			</output>
		</layer>
		<layer id="108" name="465/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="465/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="465" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="455" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="455" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="454" type="Const" version="opset1">
			<data element_type="i32" offset="44104" shape="" size="4"/>
			<output>
				<port id="0" names="454" precision="I32"/>
			</output>
		</layer>
		<layer id="112" name="456/axis" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="113" name="4562814" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="456" precision="I64"/>
			</output>
		</layer>
		<layer id="114" name="466/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="466/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="466" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="458" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="458" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="457" type="Const" version="opset1">
			<data element_type="i32" offset="44108" shape="" size="4"/>
			<output>
				<port id="0" names="457" precision="I32"/>
			</output>
		</layer>
		<layer id="118" name="459/axis" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="119" name="4592700" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="459" precision="I64"/>
			</output>
		</layer>
		<layer id="120" name="467/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="467/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="467" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="468" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" names="468" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="469" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="469" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="1695" type="Const" version="opset1">
			<data element_type="i64" offset="44112" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="470" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="470" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="471/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="471/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="471" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="472/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="472/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="472" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="473/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="473/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="473" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="474/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="44084" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="474/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="474" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="475" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="475" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="476" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="476" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="477/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="44152" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="137" name="477/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" offset="44160" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="477/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="477" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" names="478" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="480/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="73872" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="backbone.features.stage1.unit3.compress_conv1.weight" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="479" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="data_add_3812938134" type="Const" version="opset1">
			<data element_type="f32" offset="87328" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
