<?xml version="1.0" ?>
<net name="person-attributes-recognition-crossroad-0238" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 160, 80"/>
			<output>
				<port id="0" names="input" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_16811" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1, 3, 1, 1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_16813" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="1, 3, 1, 1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="626/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="32, 3, 3, 3" size="3456"/>
			<output>
				<port id="0" names="model.backbone._inception.Conv2d_1a_3x3.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="625" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_1681616821" type="Const" version="opset1">
			<data element_type="f32" offset="3480" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="626/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="626" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="627" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1" names="627" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="629/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="3608" shape="32, 32, 3, 3" size="36864"/>
			<output>
				<port id="0" names="model.backbone._inception.Conv2d_2a_3x3.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="628" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_1682416829" type="Const" version="opset1">
			<data element_type="f32" offset="40472" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="629/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="629" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="630" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" names="630" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="632/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="40600" shape="64, 32, 3, 3" size="73728"/>
			<output>
				<port id="0" names="model.backbone._inception.Conv2d_2b_3x3.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="631" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_1683216837" type="Const" version="opset1">
			<data element_type="f32" offset="114328" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="632/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="632" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="633" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" names="633" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="634" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" names="634" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="636/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="114584" shape="80, 64, 1, 1" size="20480"/>
			<output>
				<port id="0" names="model.backbone._inception.Conv2d_3b_1x1.conv.weight" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="635" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_1684016845" type="Const" version="opset1">
			<data element_type="f32" offset="135064" shape="1, 80, 1, 1" size="320"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="636/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="636" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="637" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" names="637" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="639/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="135384" shape="192, 80, 3, 3" size="552960"/>
			<output>
				<port id="0" names="model.backbone._inception.Conv2d_4a_3x3.conv.weight" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="638" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_1684816853" type="Const" version="opset1">
			<data element_type="f32" offset="688344" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="639/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="639" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="640" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="640" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="641" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="641" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="643/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="689112" shape="64, 192, 1, 1" size="49152"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5b.branch1x1.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="642" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_1690416909" type="Const" version="opset1">
			<data element_type="f32" offset="738264" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="643/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="643" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="644" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="644" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="646/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="738520" shape="48, 192, 1, 1" size="36864"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5b.branch5x5_1.conv.weight" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="645" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="data_add_1688816893" type="Const" version="opset1">
			<data element_type="f32" offset="775384" shape="1, 48, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="646/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="646" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="647" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="647" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="649/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="775576" shape="64, 48, 5, 5" size="307200"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5b.branch5x5_2.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="648" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="data_add_1689616901" type="Const" version="opset1">
			<data element_type="f32" offset="1082776" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="649/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="649" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="650" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="650" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="652/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1083032" shape="64, 192, 1, 1" size="49152"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5b.branch3x3dbl_1.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="651" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_1686416869" type="Const" version="opset1">
			<data element_type="f32" offset="1132184" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="652/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="652" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="653" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="653" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="655/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1132440" shape="96, 64, 3, 3" size="221184"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5b.branch3x3dbl_2.conv.weight" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="654" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_1687216877" type="Const" version="opset1">
			<data element_type="f32" offset="1353624" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="655/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="655" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="656" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="656" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="658/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1354008" shape="96, 96, 3, 3" size="331776"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5b.branch3x3dbl_3.conv.weight" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="657" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_1688016885" type="Const" version="opset1">
			<data element_type="f32" offset="1685784" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="658/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="658" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="659" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="659" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1060" type="Const" version="opset1">
			<data element_type="i64" offset="1686168" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="1061" type="Const" version="opset1">
			<data element_type="i64" offset="1686168" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="660/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" offset="1686200" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="660/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="660" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" names="660" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="661" type="AvgPool" version="opset1">
			<data auto_pad="explicit" exclude-pad="true" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" names="661" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="663/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1686204" shape="32, 192, 1, 1" size="24576"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5b.branch_pool.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="662" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="data_add_1685616861" type="Const" version="opset1">
			<data element_type="f32" offset="1710780" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="663/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="663" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="664" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="664" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="665" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="4" names="665" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="667/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1710908" shape="64, 256, 1, 1" size="65536"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5c.branch1x1.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="666" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="data_add_1696016965" type="Const" version="opset1">
			<data element_type="f32" offset="1776444" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="667/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="667" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="668" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="668" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="670/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1776700" shape="48, 256, 1, 1" size="49152"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5c.branch5x5_1.conv.weight" precision="FP32">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="669" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_1694416949" type="Const" version="opset1">
			<data element_type="f32" offset="1825852" shape="1, 48, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="670/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="670" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="671" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="671" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="673/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1826044" shape="64, 48, 5, 5" size="307200"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5c.branch5x5_2.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="672" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="data_add_1695216957" type="Const" version="opset1">
			<data element_type="f32" offset="2133244" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="673/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="673" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="674" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="674" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="676/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="2133500" shape="64, 256, 1, 1" size="65536"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5c.branch3x3dbl_1.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="675" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_add_1692016925" type="Const" version="opset1">
			<data element_type="f32" offset="2199036" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="676/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="676" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="677" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="677" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="679/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="2199292" shape="96, 64, 3, 3" size="221184"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5c.branch3x3dbl_2.conv.weight" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="678" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="data_add_1692816933" type="Const" version="opset1">
			<data element_type="f32" offset="2420476" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="679/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="679" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="680" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="680" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="682/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="2420860" shape="96, 96, 3, 3" size="331776"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5c.branch3x3dbl_3.conv.weight" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="681" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="data_add_1693616941" type="Const" version="opset1">
			<data element_type="f32" offset="2752636" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="682/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="682" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="683" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="683" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="1065" type="Const" version="opset1">
			<data element_type="i64" offset="1686168" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="1066" type="Const" version="opset1">
			<data element_type="i64" offset="1686168" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="684/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" offset="1686200" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="684/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="684" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" names="684" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>19</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="685" type="AvgPool" version="opset1">
			<data auto_pad="explicit" exclude-pad="true" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>19</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" names="685" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="687/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="2753020" shape="64, 256, 1, 1" size="65536"/>
			<output>
				<port id="0" names="model.backbone._inception.Mixed_5c.branch_pool.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="686" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="data_add_1691216917" type="Const" version="opset1">
			<data element_type="f32" offset="2818556" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="687/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="687" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="688" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="688" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="689" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>17</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
