<?xml version="1.0" ?>
<net name="person-attributes-recognition-crossroad-0234" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 160, 80"/>
			<output>
				<port id="0" names="input" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_9693" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_9695" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="380/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="64, 3, 7, 7" size="18816"/>
			<output>
				<port id="0" names="model.backbone._resnet.conv1.weight" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="379" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_96989703" type="Const" version="opset1">
			<data element_type="f16" offset="18828" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="380/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="380" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="381" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="381" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="382" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3, 3" pads_begin="1, 1" pads_end="1, 1" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="382" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="384/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="18956" shape="64, 64, 1, 1" size="8192"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.0.conv1.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="383" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_97149719" type="Const" version="opset1">
			<data element_type="f16" offset="27148" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="384/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="384" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="385" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="385" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="387/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="27276" shape="64, 64, 3, 3" size="73728"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.0.conv2.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="386" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_97229727" type="Const" version="opset1">
			<data element_type="f16" offset="101004" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="387/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="387" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="388" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="388" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="390/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="101132" shape="256, 64, 1, 1" size="32768"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.0.conv3.weight" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="389" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_97309735" type="Const" version="opset1">
			<data element_type="f16" offset="133900" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="390/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="390" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="392/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="134412" shape="256, 64, 1, 1" size="32768"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.0.downsample.0.weight" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="391" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_97069711" type="Const" version="opset1">
			<data element_type="f16" offset="167180" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="392/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="392" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="393" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="393" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="394" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="394" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="396/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="167692" shape="64, 256, 1, 1" size="32768"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.1.conv1.weight" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="395" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_97389743" type="Const" version="opset1">
			<data element_type="f16" offset="200460" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="396/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="396" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="397" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="397" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="399/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="200588" shape="64, 64, 3, 3" size="73728"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.1.conv2.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="398" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_97469751" type="Const" version="opset1">
			<data element_type="f16" offset="274316" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="399/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="399" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="400" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="400" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="402/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="274444" shape="256, 64, 1, 1" size="32768"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.1.conv3.weight" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="401" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_97549759" type="Const" version="opset1">
			<data element_type="f16" offset="307212" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="402/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="402" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="403" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="403" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="404" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="404" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="406/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="307724" shape="64, 256, 1, 1" size="32768"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.2.conv1.weight" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="405" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_97629767" type="Const" version="opset1">
			<data element_type="f16" offset="340492" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="406/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="406" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="407" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="407" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="409/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="340620" shape="64, 64, 3, 3" size="73728"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.2.conv2.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="408" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_97709775" type="Const" version="opset1">
			<data element_type="f16" offset="414348" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="409/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="409" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="410" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="410" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="412/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="414476" shape="256, 64, 1, 1" size="32768"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer1.2.conv3.weight" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="411" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_97789783" type="Const" version="opset1">
			<data element_type="f16" offset="447244" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="412/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="412" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="413" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" names="413" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="414" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="414" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="416/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="447756" shape="128, 256, 1, 1" size="65536"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.0.conv1.weight" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="415" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_97949799" type="Const" version="opset1">
			<data element_type="f16" offset="513292" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="416/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="416" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="417" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" names="417" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="419/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="513548" shape="128, 128, 3, 3" size="294912"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.0.conv2.weight" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="418" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="data_add_98029807" type="Const" version="opset1">
			<data element_type="f16" offset="808460" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="419/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="419" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="420" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="420" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="422/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="808716" shape="512, 128, 1, 1" size="131072"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.0.conv3.weight" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="421" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_98109815" type="Const" version="opset1">
			<data element_type="f16" offset="939788" shape="1, 512, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="422/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="422" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="424/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="940812" shape="512, 256, 1, 1" size="262144"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.0.downsample.0.weight" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="423" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="data_add_97869791" type="Const" version="opset1">
			<data element_type="f16" offset="1202956" shape="1, 512, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="424/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="424" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="425" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" names="425" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="426" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="426" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="428/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1203980" shape="128, 512, 1, 1" size="131072"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.1.conv1.weight" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="427" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="data_add_98189823" type="Const" version="opset1">
			<data element_type="f16" offset="1335052" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="428/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="428" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="429" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="429" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="431/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1335308" shape="128, 128, 3, 3" size="294912"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.1.conv2.weight" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="430" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="data_add_98269831" type="Const" version="opset1">
			<data element_type="f16" offset="1630220" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="431/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="431" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="432" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="432" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="434/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1630476" shape="512, 128, 1, 1" size="131072"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.1.conv3.weight" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="433" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="data_add_98349839" type="Const" version="opset1">
			<data element_type="f16" offset="1761548" shape="1, 512, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="434/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="434" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="435" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" names="435" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="436" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="436" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="438/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1762572" shape="128, 512, 1, 1" size="131072"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.2.conv1.weight" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="437" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="data_add_98429847" type="Const" version="opset1">
			<data element_type="f16" offset="1893644" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="438/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="438" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="439" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="439" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="441/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1893900" shape="128, 128, 3, 3" size="294912"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.2.conv2.weight" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="440" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="data_add_98509855" type="Const" version="opset1">
			<data element_type="f16" offset="2188812" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="441/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="441" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="442" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="442" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="444/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="2189068" shape="512, 128, 1, 1" size="131072"/>
			<output>
				<port id="0" names="model.backbone._resnet.layer2.2.conv3.weight" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="443" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="data_add_98589863" type="Const" version="opset1">
			<data element_type="f16" offset="2320140" shape="1, 512, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="444/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="444" precision="FP16">
					<dim>1</dim>
